# DataFrame

Objeto bi-dimensional que contém dados em forma tabular.

In [23]:
import pandas as pd

Criando um DataFrame

In [24]:
df = pd.DataFrame()

In [25]:
dic_df = {'identificacao': [1,2,3,4,5],
          'nome': ['Rafael', 'Rafão', 'Rafux', 'Rafainha', 'Rafo']}

df1 = pd.DataFrame(data = dic_df)
df1

   identificacao      nome
0              1    Rafael
1              2     Rafão
2              3     Rafux
3              4  Rafainha
4              5      Rafo

In [26]:
#Passando parâmetros de índices

df2 = pd.DataFrame(data = dic_df, index= [22,45,71,23,33])
df2

    identificacao      nome
22              1    Rafael
45              2     Rafão
71              3     Rafux
23              4  Rafainha
33              5      Rafo

Criando DataFrame utilizando "array"

In [27]:
import numpy as np

In [28]:
array1 = np.array([[1, 2, 3],
                   ['Rio de Janeiro','São Paulo','Minas Gerais'],
                   ['RJ', 'SP', 'MG']])

array1

array([['1', '2', '3'],
       ['Rio de Janeiro', 'São Paulo', 'Minas Gerais'],
       ['RJ', 'SP', 'MG']], dtype='<U14')

In [29]:
df3 = pd.DataFrame(data = array1.transpose(),
                   index = ['linha1', 'linha2', 'linha3'],
                   columns = ['identificacao', 'cidade', 'estado'])
            
df3

       identificacao          cidade estado
linha1             1  Rio de Janeiro     RJ
linha2             2       São Paulo     SP
linha3             3    Minas Gerais     MG

In [32]:
df3['index'] = 0

df3

       identificacao          cidade estado  index
linha1             1  Rio de Janeiro     RJ      0
linha2             2       São Paulo     SP      0
linha3             3    Minas Gerais     MG      0